package Units;

import java.util.Random;

public class NameList {
    private String[] nameList = {"Дэйв", "Джон", "Стэн", "Чез", "Максимус", "Стэфан", "Люций", "Аарон", "Филл", "Стьюи", "Марк",
            "Ричард", "Зейн", "Карл", "Джек", "Джерард", "Лео", "Бред", "Сэм", "Дин", "Дэймон", "Себастиян", "Килиан", "Боб", "Коул",
            "Люк", "Дракс", "СтарЛорд", "Зак", "Роберт", "Тор", "Роб", "Карим", "Цыган", "Рик", "Морти", "Дон", "Уильям", "Майк",
            "Клайв", "Кларк", "Алекс", "Макйл", "Мэнни", "Джо", "Чендлер", "Росс", "Дик", "Хью", "Пит", "Зойдберг", "Фрай", "Гомер", "Патрик"};

    public String getRandomName() {
        Random randomName = new Random();
        return nameList[randomName.nextInt(nameList.length)];
    }
}
