public class DateHelper {

    public String getFormattedStartDate() {
        //возвращает отформатированную
        //(в формате на ваш выбор) дату и время начала сражения.
        // Дата должна соответствовать текущей минус 1500 лет.
        return "ДАТА";
    }

    public void skipTime() {
        //проматывает константное время (длительность)
        // одного раунда сражения, например, 45 минут
    }

    public String getFormattedDiff(){
        //возвращает отформатированную (в формате на ваш выбор) длительность сражения, как разницу между
        //временем, на которое проматывалось время сражения, и временем начала сражения.
        return "duration";
    }
}
